app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')
---
  Include:
  <% Movie.all_ratings.each do |rating| %>