app/controllers/movies_controller.rb

    def index

      @all_ratings = Movie.all_ratings
      if params[:ratings] == nil and session[:ratings] == nil
        @ratings_to_show = nil
      elsif params[:ratings] == nil and session[:ratings] != nil
        @ratings_to_show = session[:ratings]
        # redirect_to movies_path({:ratings => session[:ratings]})
      else
        @ratings_to_show = params[:ratings]
      end
      if @ratings_to_show == nil
        @ratings_to_show = @all_ratings
      elsif @ratings_to_show.is_a?(Hash)
        @ratings_to_show = @ratings_to_show.keys
      end
      @movies = Movie.with_ratings(@ratings_to_show)
      if params[:title] == '1'
        @sort_by = 'title'
        @movies = @movies.order(:title)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')  ORDER BY "movies"."title" ASC